---
kind: property
id: P:Autodesk.Revit.DB.Events.RevitAPIPostEventArgs.Status
source: html/01c1c4b6-fc91-0651-3312-4d988073433a.htm
---
# Autodesk.Revit.DB.Events.RevitAPIPostEventArgs.Status Property

Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an API event handler).

## Syntax (C#)
```csharp
public RevitAPIEventStatus Status { get; }
```